# Напишите программу, которая выводит на экран текст «I***like***Python» (без кавычек).
# Используйте необязательный параметр sep.
# print('I', 'like', 'Python', sep = '**')


# Напишите программу, которая считывает строку-разделитель и три строки,
# а затем выводит указанные строки через разделитель.
# На вход программе подаётся строка-разделитель и три строки, каждая на отдельной строке.
# r = input()
# a = input()
# b = input()
# c = input()
# print(a, b, c, sep= r)


# Напишите программу, которая приветствует пользователя, выводя слово «Привет» (без кавычек),
# после которого должна стоять запятая и пробел, а затем введенное имя и восклицательный знак.
# На вход программе подаётся одна строка — имя пользователя.
# Используйте необязательный параметр end.
# a = input()
# print('Привет,', a, end='!')