# Напишите программу, которая определяет, оканчивается ли год с данным номером на два нуля.
# Если год оканчивается, то выведите «YES», иначе выведите «NO».
# На вход программе подаётся натуральное число.
# y = int(input())
# if y % 1000 == 0:
#     print('YES')
# else:
#     print('NO')


# Заданы две клетки шахматной доски. Напишите программу, которая определяет имеют ли указанные клетки один цвет или нет.
# Если они покрашены в один цвет, то выведите слово «YES», а если в разные цвета — то «NO».
# На вход программе подаётся четыре числа от 1 до 8 каждое,
# задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки.
# x1, y1, x2, y2 = int(input()), int(input()), int(input()), int(input())
# if (x1 + y1 + x2 + y2) % 2 == 0:
#     print('YES')
# else:
#     print('NO')


# Футбольная команда набирает девочек от 10 до 15 лет включительно.
# Напишите программу, которая запрашивает возраст и пол претендента, используя обозначение пола буквы m (от male – мужчина)
# и f (от female – женщина) и определяет подходит ли претендент для вступления в команду или нет.
# Если претендент подходит, то выведите «YES», иначе выведите «NO».
# На вход программе подаётся натуральное число – возраст претендента и буква обозначающая пол m (мужчина) или f (женщина).
# age, s = int(input()), input()
# if 10 <= age <= 15 and s == 'f':
#     print('YES')
# else:
#     print('NO')


# Напишите программу, которая считывает целое число и выводит соответствующую ему римскую цифру.
# Если число находится вне диапазона 1-10, то программа должна вывести текст «ошибка».
# На вход программе подаётся целое число.
# num = int(input())
# # if num > 10:
# #     print('ошибка')
# if num == 1:
#     print('I')
# elif num == 2:
#     print('II')
# elif num == 3:
#     print('III')
# elif num == 4:
#     print('IV')
# elif num == 5:
#     print('V')
# elif num == 6:
#     print('VI')
# elif num == 7:
#     print('VII')
# elif num == 8:
#     print('VIII')
# elif num == 9:
#     print('IX')
# elif num == 10:
#     print('X')
# else:
#     print('ошибка')
# Петя, если ты это читаешь, то знай, что решить задачу нужно было именно таким примитивным образом,
# т к мы еще не проходили тут библиотеки. И я помню про твоё задание про римские цифры)


# Напишите программу, которая принимает на вход число и в зависимости от условий выводит текст «YES», либо «NO».
# Условия:
# если число нечётное, то вывести «YES»;
# если число чётное в диапазоне от 2 до 5 (включительно), то вывести «NO»;
# если число чётное в диапазоне от 6 до 20 (включительно), то вывести «YES»;
# если число чётное и больше 20, то вывести «NO».
# На вход программе подаётся натуральное число.
# num = int(input())
# if ((2 <= num <= 5) and num % 2 == 0) or ((num > 20) and num % 2 == 0):
#     print('NO')
# elif (num % 2 == 1) or ((6 <= num <= 20) and num % 2 == 0):
#     print('YES')


# Даны две различные клетки шахматной доски.
# Напишите программу, которая определяет, может ли слон попасть с первой клетки на вторую одним ходом.
# Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки
# сначала для первой клетки, потом для второй клетки. Программа должна вывести «YES», если из первой клетки
# ходом слона можно попасть во вторую или «NO» в противном случае.
# На вход программе подаётся четыре числа от 1 до 8.
# x1, y1, x2, y2 = int(input()), int(input()), int(input()), int(input())
# if abs(x2 - x1) == abs(y2 - y1):
#     print('YES')
# else:
#     print('NO')


# Даны две различные клетки шахматной доски.
# Напишите программу,  которая определяет, может ли конь попасть с первой клетки на вторую одним ходом.
# Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала
# для первой клетки, потом для второй клетки.
# Программа должна вывести «YES», если из первой клетки ходом коня можно попасть во вторую или «NO» в противном случае.
# На вход программе подаётся четыре числа от 1 до 8.
# x1, y1, x2, y2 = int(input()), int(input()), int(input()), int(input())
# a = x1 - x2
# c = y1 - y2
# if x1 != x2 and y1 != y2:
#     if (a in (-1, 1) and c in (-2, 2)) or (c in (-1, 1) and a in (-2, 2)):
#         print('YES')
# else:
#     print('NO')


# Даны две различные клетки шахматной доски.
# Напишите программу,  которая определяет, может ли ферзь попасть с первой клетки на вторую одним ходом.
# Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала
# для первой клетки, потом для второй клетки.
# Программа должна вывести «YES», если из первой клетки ходом ферзя можно попасть во вторую или «NO» в противном случае.
# На вход программе подаётся четыре числа от 1 до 8.
# x1, y1, x2, y2 = int(input()), int(input()), int(input()), int(input())
# if abs(x2 - x1) == abs(y2 - y1) or x1 == x2 or y1 == y2:
#     print('YES')
# else:
#     print('NO')